<script setup lang="ts"></script>

<template>
    <div>
        <div class="flex">
            <img src="../assets/images/dead-cell.png" alt="" />
            <h1>ЖИВАЯ КЛЕТКА</h1>
            <img src="../assets/images/live-cell.png" alt="" />
        </div>
        <p>
            Игра «Жизнь» (англ. Game of Life) — клеточный автомат, придуманный
            английским математиком Джоном Конвеем в 1970 году. Это игра без
            игроков, в которой человек создаёт начальное состояние, а потом лишь
            наблюдает за её развитием.
        </p>
        <h3
            class="top"
            title="Игра «Жизнь»происходит на клеточном поле, которое, традиционно,
                называется «вселенная». Каждая клетка может быть живой или
                мёртвой. Поколения сменяются синхронно по простым правилам: в
                пустой (мёртвой) клетке, рядом с которой ровно три живые клетки,
                зарождается жизнь; если у живой клетки есть две или три живые
                соседки, то эта клетка продолжает жить; в противном случае (если
                соседей меньше двух или больше трёх) клетка умирает («от
                одиночества» или «от перенаселённости»)."
        >
            Правила игры «Жизнь»
        </h3>
    </div>
</template>

<style scoped>
img {
    width: 130px;
}

div {
    justify-content: center;
}

.top {
    cursor: pointer;
}
</style>
